{
  "quotes": {
    "dev_humor": [
      "I'm fairly convinced the main difference between a senior dev and a junior dev is the senior knows how to hide the evidence.",
      "A monad is just a monoid in the category of endofunctors",
      "x86 has way too many instructions",
      "Psst, it's :q",
      "Why do programmers always mix up Halloween and Christmas? Because Oct 31 == Dec 25"
    ],
    "inspiration": [
      "He never lost heart, and never looked back. He marched in one direction, and that direction was dead ahead.",
      "Non Visum Vindere",
      "Eyes are Useless when the Mind is Blind",
      "life is 10% what happens to me and 90% how I react to it",
      "Expect the Unexpected",
      "I went to a bookstore and asked the saleswoman, “where’s the self-help section?” She said if she told me, it would defeat the purpose."
    ],
    "zen": [
      "無",
      "僧問：狗子還有佛性也無？ 師云：無。",
      "仏に逢えば仏を殺せ",
      "逢佛殺佛"
    ],
    "philosophy": [
      "Never attribute to malice that which is adequately explained by stupidity.",
      "Pluralitas non est ponenda sine necessitate",
      "What can be asserted without evidence can be dismissed without evidence",
      "Know thyself"
    ],
    "mark": [
      "Do not ask a question you know the answer to",
      "Do not ask a question you do not want to know the answer to",
      "Do not ask a question you do not want to be asked"
    ],
    "security": [
      "MYSQL Server 5.5.45 secretly runs two parallel databases for people who say 'S-Q-L' and 'SEQUEL'",
      "Turns out Cloud is just other people's computers.",
      "An attacker can execute malicious code on their own machine and no one can stop them",
      "At the cafe on third street, the post-it note with the WiFi password is visible from the sidewalk"
    ],
    "dev_proverb": [
      "Programs are meant to be read by humans and only incidentally for computers to execute",
      "Apps ate the world, the web ate apps, and JavaScript ate the web."
    ]
  }
}
